syermak123/stm32f411-blackpill-expander/src/main.c
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_adc.h"
#include <stdbool.h>
#include <string.h>

// ----------------- Protocol -----------------
// I2C slave address: 0x30
// Commands (master -> slave):
//   0x01 [mask]            - set 8 digital outputs
//   0x02 [ch] [0|1]        - set one digital output
//   0x10 [0|1]             - set status LED
//   0x20 [pot] [value]     - set MCP41010 pot (0..3, 0..255)
//   0x21                  - prepare next read: 4 bytes pot values (P0..P3)
//   0x30                  - prepare next read: 6 bytes RTC time (YY MM DD HH MM SS; year=2000+YY)
//   0x31 [YY MM DD HH MM SS] - set RTC time
//   0x40 [dirL dirH]       - set 16-pin direction bitmask (1=output, 0=input)
//   0x41 [outL outH]       - set 16-pin outputs (only applied to pins configured as output)
//   0x42 [idx] [0|1]       - set one pin output level (also forces that pin to output)
//   0x43                  - prepare next read: 2 bytes pin levels (inL inH) for 16 pins
//   0x44                  - prepare next read: 20 bytes — 10x uint16 LE, ADC IN0..IN9
//                           (PA0..PA7, PB0, PB1). Channels unavailable on this board
//                           (SPI1: PA5..PA7; MCP41010 CS: PB0, PB1) return 0xFFFF.
//   0x45 [maskL maskH]    - set ADC mode for U8..U11 (PA1..PA4): bit=1 → pin is analog ADC;
//                           only bits 8..11 of 16-bit mask are used. Mutually exclusive with
//                           digital GPIO on those pins: cleared by 0x40 (full dir update) or
//                           0x42 on that index (forces output). Output/input for U8..U11: use
//                           0x40/0x41/0x42 with ADC bits cleared.
// Read (master <- slave), after a write command:
//   default: 1 byte current output mask
//   after 0x21: 4 bytes pot values (P0..P3)
//   after 0x30: 6 bytes RTC time
//   after 0x43: 2 bytes pin levels (16 pins)
//   after 0x44: 20 bytes — ADC raw 12-bit (0..4095), little-endian per channel
//
// Hardware mapping (Blackpill F411CE):
// I2C1: PB6=SCL, PB7=SDA
// SPI1 (for MCP41010): PA5=SCK, PA6=MISO (unused, pull — not on MCP41010), PA7=MOSI
// MCP41010 CS: PB0, PB1, PB2, PB10
// 8 digital outs: PA8..PA12 + PB12..PB14 (never PA13/14 — those are SWD)
// Status LED: PC13 (active low on many Blackpill boards)

#define I2C_SLAVE_ADDR_7BIT   0x30U
#define CMD_SET_MASK          0x01U
#define CMD_SET_CHANNEL       0x02U
#define CMD_SET_LED           0x10U
#define CMD_SET_POT           0x20U
#define CMD_GET_POTS          0x21U
#define CMD_RTC_GET           0x30U
#define CMD_RTC_SET           0x31U
#define CMD_GPIO_DIR          0x40U
#define CMD_GPIO_WRITE        0x41U
#define CMD_GPIO_WRITE1       0x42U
#define CMD_GPIO_READ         0x43U
#define CMD_ADC_READ          0x44U
#define CMD_GPIO_ADC          0x45U
#define GPIO_ADC_MASK_U8_U11  0x0F00U
#define POT_STARTUP_VALUE     200U
#define I2C_RX_BUF_SIZE       8U
#define ADC_NUM_CHANNELS      10U
#define ADC_NA                0xFFFFU

I2C_HandleTypeDef hi2c1;
SPI_HandleTypeDef hspi1;
DMA_HandleTypeDef hdma_spi1_tx;
ADC_HandleTypeDef hadc1;
RTC_HandleTypeDef hrtc;
IWDG_HandleTypeDef hiwdg;

static volatile uint8_t g_outputMask = 0;  // legacy lower 8 outputs
static volatile uint8_t g_ledState = 0;
static volatile bool g_spiBusy = false;
static volatile bool g_i2cRxActive = false;
static volatile uint32_t g_lastI2cMs = 0;

static uint8_t g_i2cRxBuf[I2C_RX_BUF_SIZE];
static uint8_t g_i2cTxBuf[32];
static uint8_t g_i2cTxLen = 0;
static uint8_t g_i2cTxIdx = 0;
static uint8_t g_i2cCmd = 0;
static uint8_t g_i2cExpected = 0;
static uint8_t g_i2cReceived = 0;
static volatile bool g_sendPotsOnNextRead = false;
static volatile uint8_t g_sendRtcOnNextRead = 0;
static volatile uint8_t g_sendGpioOnNextRead = 0;
static volatile uint8_t g_sendAdcOnNextRead = 0;

static volatile bool g_potPending[4] = {false, false, false, false};
static volatile uint8_t g_potValue[4] = {
    POT_STARTUP_VALUE, POT_STARTUP_VALUE, POT_STARTUP_VALUE, POT_STARTUP_VALUE};
static volatile uint8_t g_activePot = 0xFF;
static uint8_t g_spiTxBuf[2] = {0x11, POT_STARTUP_VALUE};  // 0x11=write pot0

static uint8_t g_adcPrepared[ADC_NUM_CHANNELS * 2];

// 16 universal pins: can be input or output.
// Avoid SWD (PA13/PA14), I2C (PB6/PB7), SPI1 (PA5/PA6/PA7), and CS pins (PB0/PB1/PB2/PB10).
static const uint16_t U_PINS[16] = {
    // U0..U7 (keeps old mapping for outputs)
    GPIO_PIN_8,   // U0: PA8
    GPIO_PIN_9,   // U1: PA9
    GPIO_PIN_10,  // U2: PA10
    GPIO_PIN_11,  // U3: PA11
    GPIO_PIN_12,  // U4: PA12
    GPIO_PIN_12,  // U5: PB12
    GPIO_PIN_13,  // U6: PB13
    GPIO_PIN_14,  // U7: PB14
    // U8..U15 (extra 8 pins)
    GPIO_PIN_1,   // U8:  PA1
    GPIO_PIN_2,   // U9:  PA2
    GPIO_PIN_3,   // U10: PA3
    GPIO_PIN_4,   // U11: PA4
    GPIO_PIN_3,   // U12: PB3
    GPIO_PIN_4,   // U13: PB4
    GPIO_PIN_5,   // U14: PB5
    GPIO_PIN_8,   // U15: PB8
};

static GPIO_TypeDef *const U_PORTS[16] = {
    GPIOA, GPIOA, GPIOA, GPIOA, GPIOA, GPIOB, GPIOB, GPIOB,
    GPIOA, GPIOA, GPIOA, GPIOA, GPIOB, GPIOB, GPIOB, GPIOB
};

static volatile uint16_t g_gpioDir = 0x00U;   // 1=output
static volatile uint16_t g_gpioOut = 0x0000U; // output shadow
/* Bits 8..11 (U8..U11 = PA1..PA4): 1 = pin configured as analog ADC (not digital GPIO). */
static volatile uint16_t g_gpioAdcMask = 0x0000U;

static const uint16_t POT_CS_PINS[4] = {
    GPIO_PIN_0,   // PB0
    GPIO_PIN_1,   // PB1
    GPIO_PIN_2,   // PB2
    GPIO_PIN_10   // PB10
};

void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI1_Init(void);
static void MX_RTC_Init(void);
static void MX_ADC1_Init(void);
static void MX_IWDG_Init(void);
static void Error_Handler(void);
static void ApplyGpioConfig(void);

static void SetPinAnalog(GPIO_TypeDef *port, uint32_t pin) {
  GPIO_InitTypeDef io = {0};
  io.Pin = pin;
  io.Mode = GPIO_MODE_ANALOG;
  io.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(port, &io);
}

static uint16_t AdcReadChannel(uint32_t channel) {
  ADC_ChannelConfTypeDef sConfig = {0};
  sConfig.Channel = channel;
  sConfig.Rank = 1;
  sConfig.SamplingTime = ADC_SAMPLETIME_144CYCLES;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
    return ADC_NA;
  }
  if (HAL_ADC_Start(&hadc1) != HAL_OK) {
    return ADC_NA;
  }
  if (HAL_ADC_PollForConversion(&hadc1, 80) != HAL_OK) {
    (void)HAL_ADC_Stop(&hadc1);
    return ADC_NA;
  }
  uint32_t raw = HAL_ADC_GetValue(&hadc1);
  (void)HAL_ADC_Stop(&hadc1);
  return (uint16_t)(raw & 0x0FFFU);
}

/* Fills 10 values for ADC1_IN0..IN9 (MCU pins PA0..PA7, PB0, PB1).
 * IN5..IN7 (PA5..PA7): SPI1 — not usable as ADC while SPI pots are used.
 * IN8..IN9 (PB0, PB1): MCP41010 chip-select outputs — not usable as analog inputs here.
 * IN0..IN4: PA0 always sampled; PA1..PA4 use persistent analog if g_gpioAdcMask, else
 *   brief switch to analog then ApplyGpioConfig restores digital GPIO. */
static void AdcSampleAndPackPrepared(void) {
  uint16_t v[ADC_NUM_CHANNELS];
  for (uint32_t i = 0; i < ADC_NUM_CHANNELS; i++) {
    v[i] = ADC_NA;
  }

  /* IN0 PA0 — not used as universal GPIO in this firmware */
  SetPinAnalog(GPIOA, GPIO_PIN_0);
  v[0] = AdcReadChannel(ADC_CHANNEL_0);

  /* IN1..IN4 PA1..PA4 — shared with U8..U11 */
  const uint32_t pa_pins[4] = {GPIO_PIN_1, GPIO_PIN_2, GPIO_PIN_3, GPIO_PIN_4};
  const uint32_t adc_ch[4] = {
      ADC_CHANNEL_1, ADC_CHANNEL_2, ADC_CHANNEL_3, ADC_CHANNEL_4};
  for (int k = 0; k < 4; k++) {
    const uint8_t uidx = (uint8_t)(8 + k);
    if (((g_gpioAdcMask >> uidx) & 0x1U) != 0U) {
      v[(uint32_t)k + 1U] = AdcReadChannel(adc_ch[k]);
    } else {
      SetPinAnalog(GPIOA, pa_pins[k]);
      v[(uint32_t)k + 1U] = AdcReadChannel(adc_ch[k]);
    }
  }
  ApplyGpioConfig();

  /* IN5..IN7 (PA5..PA7): SPI */
  /* IN8..IN9 (PB0, PB1): pot CS — leave as ADC_NA */

  for (uint32_t i = 0; i < ADC_NUM_CHANNELS; i++) {
    g_adcPrepared[i * 2U] = (uint8_t)(v[i] & 0xFFU);
    g_adcPrepared[i * 2U + 1U] = (uint8_t)((v[i] >> 8) & 0xFFU);
  }
}

static void SetStatusLed(uint8_t on) {
  g_ledState = on ? 1 : 0;
  // PC13 is often active low.
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, on ? GPIO_PIN_RESET : GPIO_PIN_SET);
}

