syermak123/stm32f411-blackpill-expander/src/main.c
static void ApplyGpioConfig(void) {
  for (uint8_t i = 0; i < 16; i++) {
    if (i >= 8U && i <= 11U && ((g_gpioAdcMask >> i) & 0x1U) != 0U) {
      SetPinAnalog(U_PORTS[i], U_PINS[i]);
      continue;
    }
    GPIO_InitTypeDef io = {0};
    io.Pin = U_PINS[i];
    if ((g_gpioDir >> i) & 0x1U) {
      io.Mode = GPIO_MODE_OUTPUT_PP;
      io.Pull = GPIO_NOPULL;
      io.Speed = GPIO_SPEED_FREQ_LOW;
      HAL_GPIO_Init(U_PORTS[i], &io);
      HAL_GPIO_WritePin(U_PORTS[i], U_PINS[i], ((g_gpioOut >> i) & 0x1U) ? GPIO_PIN_SET : GPIO_PIN_RESET);
    } else {
      io.Mode = GPIO_MODE_INPUT;
      io.Pull = GPIO_PULLUP;
      HAL_GPIO_Init(U_PORTS[i], &io);
    }
  }
}

static inline uint16_t ReadGpioLevels(void) {
  uint16_t m = 0;
  for (uint8_t i = 0; i < 16; i++) {
    if (i >= 8U && i <= 11U && ((g_gpioAdcMask >> i) & 0x1U) != 0U) {
      continue; /* ADC pins: digital level not defined; bit reads as 0 */
    }
    GPIO_PinState st = HAL_GPIO_ReadPin(U_PORTS[i], U_PINS[i]);
    if (st == GPIO_PIN_SET) m |= (uint16_t)(1U << i);
  }
  return m;
}

static void ApplyLegacyMask(uint8_t mask) {
  g_outputMask = mask;
  // Legacy outputs are U0..U7
  g_gpioDir |= 0x00FFU;
  g_gpioOut = (uint16_t)((g_gpioOut & 0xFF00U) | (uint16_t)mask);
  ApplyGpioConfig();
}

static void PotSelect(uint8_t pot, GPIO_PinState level) {
  if (pot < 4) {
    HAL_GPIO_WritePin(GPIOB, POT_CS_PINS[pot], level);
  }
}

static void StartPotWriteDMA(uint8_t pot, uint8_t value) {
  if (pot > 3 || g_spiBusy) return;
  g_activePot = pot;
  g_spiTxBuf[0] = 0x11U;
  g_spiTxBuf[1] = value;
  g_spiBusy = true;

  PotSelect(pot, GPIO_PIN_RESET);
  /* Short setup so CS and SI are stable before first SCK (datasheet t_CSS) */
  for (volatile uint32_t d = 0; d < 80; d++) {
    __NOP();
  }
  if (HAL_SPI_Transmit_DMA(&hspi1, g_spiTxBuf, 2) != HAL_OK) {
    PotSelect(pot, GPIO_PIN_SET);
    g_spiBusy = false;
    g_activePot = 0xFF;
  }
}

static void PumpPotQueue(void) {
  if (g_spiBusy) return;
  for (uint8_t i = 0; i < 4; i++) {
    if (g_potPending[i]) {
      g_potPending[i] = false;
      StartPotWriteDMA(i, g_potValue[i]);
      return;
    }
  }
}

static uint8_t CommandExpectedLen(uint8_t cmd) {
  switch (cmd) {
    case CMD_SET_MASK: return 2;
    case CMD_SET_CHANNEL: return 3;
    case CMD_SET_LED: return 2;
    case CMD_SET_POT: return 3;
    case CMD_GET_POTS: return 1;
    case CMD_RTC_GET: return 1;
    case CMD_RTC_SET: return 7;
    case CMD_GPIO_DIR: return 3;
    case CMD_GPIO_WRITE: return 3;
    case CMD_GPIO_WRITE1: return 3;
    case CMD_GPIO_READ: return 1;
    case CMD_ADC_READ: return 1;
    case CMD_GPIO_ADC: return 3;
    default: return 1;
  }
}

static inline void ResetI2cSessionState(void) {
  g_i2cRxActive = false;
  g_i2cTxLen = 0;
  g_i2cTxIdx = 0;
}

static inline uint8_t bcd2bin(uint8_t v) { return (uint8_t)(((v >> 4) * 10U) + (v & 0x0FU)); }
static inline uint8_t bin2bcd(uint8_t v) { return (uint8_t)(((v / 10U) << 4) | (v % 10U)); }

static void RtcReadYmdHms(uint8_t out6[6]) {
  RTC_TimeTypeDef t = {0};
  RTC_DateTypeDef d = {0};
  (void)HAL_RTC_GetTime(&hrtc, &t, RTC_FORMAT_BCD);
  (void)HAL_RTC_GetDate(&hrtc, &d, RTC_FORMAT_BCD);  // must read date after time
  out6[0] = bcd2bin(d.Year);
  out6[1] = bcd2bin(d.Month);
  out6[2] = bcd2bin(d.Date);
  out6[3] = bcd2bin(t.Hours);
  out6[4] = bcd2bin(t.Minutes);
  out6[5] = bcd2bin(t.Seconds);
}

static void RtcSetYmdHms(const uint8_t in6[6]) {
  RTC_TimeTypeDef t = {0};
  RTC_DateTypeDef d = {0};
  d.Year = bin2bcd(in6[0]);
  d.Month = bin2bcd(in6[1]);
  d.Date = bin2bcd(in6[2]);
  d.WeekDay = RTC_WEEKDAY_MONDAY;
  t.Hours = bin2bcd(in6[3]);
  t.Minutes = bin2bcd(in6[4]);
  t.Seconds = bin2bcd(in6[5]);
  t.TimeFormat = RTC_HOURFORMAT12_AM;
  t.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
  t.StoreOperation = RTC_STOREOPERATION_RESET;
  (void)HAL_RTC_SetTime(&hrtc, &t, RTC_FORMAT_BCD);
  (void)HAL_RTC_SetDate(&hrtc, &d, RTC_FORMAT_BCD);
  (void)HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR0, 0xA5A5U);
}

static void ProcessI2cCommand(const uint8_t *buf, uint8_t len) {
  if (len == 0) return;
  uint8_t cmd = buf[0];
  if (cmd == CMD_SET_MASK && len >= 2) {
    ApplyLegacyMask(buf[1]);
    return;
  }
  if (cmd == CMD_SET_CHANNEL && len >= 3) {
    uint8_t ch = buf[1];
    uint8_t val = buf[2];
    if (ch < 8) {
      uint8_t m = g_outputMask;
      if (val) m |= (1U << ch);
      else m &= (uint8_t)~(1U << ch);
      ApplyLegacyMask(m);
    }
    return;
  }
  if (cmd == CMD_SET_LED && len >= 2) {
    SetStatusLed(buf[1] ? 1U : 0U);
    return;
  }
  if (cmd == CMD_SET_POT && len >= 3) {
    uint8_t pot = buf[1];
    uint8_t val = buf[2];
    if (pot < 4) {
      g_potValue[pot] = val;
      g_potPending[pot] = true;
    }
    return;
  }
  if (cmd == CMD_GET_POTS && len >= 1) {
    // Next I2C read will return 4 bytes: P0..P3.
    g_sendPotsOnNextRead = true;
    return;
  }
  if (cmd == CMD_RTC_GET && len >= 1) {
    g_sendRtcOnNextRead = 1U;
    return;
  }
  if (cmd == CMD_RTC_SET && len >= 7) {
    RtcSetYmdHms(&buf[1]);
    return;
  }
  if (cmd == CMD_GPIO_DIR && len >= 3) {
    /* Full direction update: exit ADC mode on PA1..PA4 (U8..U11); user may re-send 0x45. */
    g_gpioAdcMask &= (uint16_t)~GPIO_ADC_MASK_U8_U11;
    g_gpioDir = (uint16_t)buf[1] | ((uint16_t)buf[2] << 8);
    ApplyGpioConfig();
    return;
  }
  if (cmd == CMD_GPIO_WRITE && len >= 3) {
    uint16_t v = (uint16_t)buf[1] | ((uint16_t)buf[2] << 8);
    g_gpioOut = v;
    // keep legacy mirror
    g_outputMask = (uint8_t)(g_gpioOut & 0xFFU);
    ApplyGpioConfig();
    return;
  }
  if (cmd == CMD_GPIO_WRITE1 && len >= 3) {
    uint8_t idx = buf[1];
    uint8_t v = buf[2] ? 1U : 0U;
    if (idx < 16) {
      if (idx >= 8U && idx <= 11U) {
        g_gpioAdcMask &= (uint16_t)~(1U << idx);
      }
      g_gpioDir |= (uint16_t)(1U << idx);
      if (v) g_gpioOut |= (uint16_t)(1U << idx);
      else g_gpioOut &= (uint16_t)~(1U << idx);
      g_outputMask = (uint8_t)(g_gpioOut & 0xFFU);
      ApplyGpioConfig();
    }
    return;
  }
  if (cmd == CMD_GPIO_READ && len >= 1) {
    g_sendGpioOnNextRead = 1U;
    return;
  }
  if (cmd == CMD_ADC_READ && len >= 1) {
    AdcSampleAndPackPrepared();
    g_sendAdcOnNextRead = 1U;
    return;
  }
  if (cmd == CMD_GPIO_ADC && len >= 3) {
    uint16_t m = (uint16_t)buf[1] | ((uint16_t)buf[2] << 8);
    g_gpioAdcMask = (uint16_t)(m & GPIO_ADC_MASK_U8_U11);
    ApplyGpioConfig();
    return;
  }
}

int main(void) {
  HAL_Init();
  SystemClock_Config();

  // Ensure HAL_GetTick() is real milliseconds after we changed clocks.
  SystemCoreClockUpdate();
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq() / 1000U);
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);

