syermak123/stm32f411-blackpill-expander/src/main.c
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_SPI1_Init();
  MX_RTC_Init();
  MX_ADC1_Init();
  MX_I2C1_Init();
  MX_IWDG_Init();

  ApplyLegacyMask(0x00U);
  SetStatusLed(0);
  for (uint8_t i = 0; i < 4; i++) {
    PotSelect(i, GPIO_PIN_SET);
    g_potPending[i] = true;
    g_potValue[i] = POT_STARTUP_VALUE;
  }
  // Default all universal pins to input (pull-up). Legacy outputs remain off until commanded.
  g_gpioDir = 0x0000U;
  g_gpioOut = 0x0000U;
  ApplyGpioConfig();

  if (HAL_I2C_EnableListen_IT(&hi2c1) != HAL_OK) {
    Error_Handler();
  }
  g_lastI2cMs = HAL_GetTick();

  while (1) {
    PumpPotQueue();

    // Feed watchdog only if CYD (ESP32) has talked to us recently.
    // If I2C stops for >15s, we intentionally let IWDG reset the MCU.
    uint32_t now = HAL_GetTick();
    if ((now - g_lastI2cMs) < 15000U) {
      (void)HAL_IWDG_Refresh(&hiwdg);
    }
  }
}

void HAL_I2C_AddrCallback(I2C_HandleTypeDef *hi2c, uint8_t TransferDirection,
                          uint16_t AddrMatchCode) {
  (void)AddrMatchCode;
  if (hi2c != &hi2c1) return;
  g_lastI2cMs = HAL_GetTick();

  if (TransferDirection == I2C_DIRECTION_TRANSMIT) {
    g_i2cRxActive = true;
    g_i2cCmd = 0;
    g_i2cExpected = 1;
    g_i2cReceived = 0;
    HAL_I2C_Slave_Seq_Receive_IT(&hi2c1, &g_i2cRxBuf[0], 1, I2C_FIRST_FRAME);
  } else {
    // Prepare response for this read.
    g_i2cTxIdx = 0;
    if (g_sendRtcOnNextRead) {
      g_sendRtcOnNextRead = 0;
      g_i2cTxLen = 6;
      RtcReadYmdHms(&g_i2cTxBuf[0]);
    } else if (g_sendGpioOnNextRead) {
      g_sendGpioOnNextRead = 0;
      uint16_t lvl = ReadGpioLevels();
      g_i2cTxLen = 2;
      g_i2cTxBuf[0] = (uint8_t)(lvl & 0xFFU);
      g_i2cTxBuf[1] = (uint8_t)((lvl >> 8) & 0xFFU);
    } else if (g_sendAdcOnNextRead) {
      g_sendAdcOnNextRead = 0;
      g_i2cTxLen = (uint8_t)(ADC_NUM_CHANNELS * 2U);
      memcpy(g_i2cTxBuf, g_adcPrepared, g_i2cTxLen);
    } else if (g_sendPotsOnNextRead) {
      g_sendPotsOnNextRead = false;
      g_i2cTxLen = 4;
      g_i2cTxBuf[0] = g_potValue[0];
      g_i2cTxBuf[1] = g_potValue[1];
      g_i2cTxBuf[2] = g_potValue[2];
      g_i2cTxBuf[3] = g_potValue[3];
    } else {
      g_i2cTxLen = 1;
      g_i2cTxBuf[0] = g_outputMask;
    }

    uint32_t opt = (g_i2cTxLen == 1) ? I2C_LAST_FRAME : I2C_FIRST_AND_NEXT_FRAME;
    HAL_I2C_Slave_Seq_Transmit_IT(&hi2c1, &g_i2cTxBuf[0], 1, opt);
  }
}

void HAL_I2C_SlaveRxCpltCallback(I2C_HandleTypeDef *hi2c) {
  if (hi2c != &hi2c1 || !g_i2cRxActive) return;
  g_lastI2cMs = HAL_GetTick();

  g_i2cReceived++;
  if (g_i2cReceived == 1) {
    g_i2cCmd = g_i2cRxBuf[0];
    g_i2cExpected = CommandExpectedLen(g_i2cCmd);
    if (g_i2cExpected > I2C_RX_BUF_SIZE) {
      /* Defensive guard in case protocol table changes in future. */
      ResetI2cSessionState();
      return;
    }
    if (g_i2cExpected == 1) {
      ProcessI2cCommand(g_i2cRxBuf, 1);
      ResetI2cSessionState();
      return;
    }
    /* One byte per Seq step: multi-byte LAST_FRAME alone is flaky with some I2C masters (e.g. ESP32). */
    HAL_I2C_Slave_Seq_Receive_IT(
        &hi2c1, &g_i2cRxBuf[1], 1,
        (g_i2cExpected == 2) ? I2C_LAST_FRAME : I2C_NEXT_FRAME);
    return;
  }

  if (g_i2cReceived < g_i2cExpected) {
    HAL_I2C_Slave_Seq_Receive_IT(
        &hi2c1, &g_i2cRxBuf[g_i2cReceived], 1,
        (g_i2cReceived + 1U == g_i2cExpected) ? I2C_LAST_FRAME : I2C_NEXT_FRAME);
    return;
  }

  ProcessI2cCommand(g_i2cRxBuf, g_i2cExpected);
  g_i2cRxActive = false;
}

void HAL_I2C_SlaveTxCpltCallback(I2C_HandleTypeDef *hi2c) {
  if (hi2c != &hi2c1) return;
  g_lastI2cMs = HAL_GetTick();
  if (g_i2cTxLen <= 1) return;

  g_i2cTxIdx++;
  if (g_i2cTxIdx >= g_i2cTxLen) return;

  uint32_t opt = (g_i2cTxIdx + 1U == g_i2cTxLen) ? I2C_LAST_FRAME : I2C_NEXT_FRAME;
  HAL_I2C_Slave_Seq_Transmit_IT(&hi2c1, &g_i2cTxBuf[g_i2cTxIdx], 1, opt);
}

void HAL_I2C_ListenCpltCallback(I2C_HandleTypeDef *hi2c) {
  if (hi2c != &hi2c1) return;
  ResetI2cSessionState();
  HAL_I2C_EnableListen_IT(&hi2c1);
}

void HAL_I2C_ErrorCallback(I2C_HandleTypeDef *hi2c) {
  if (hi2c != &hi2c1) return;
  ResetI2cSessionState();
  HAL_I2C_EnableListen_IT(&hi2c1);
}

void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi) {
  if (hspi != &hspi1) return;
  if (g_activePot < 4) {
    PotSelect(g_activePot, GPIO_PIN_SET);
  }
  g_activePot = 0xFF;
  g_spiBusy = false;
}

void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi) {
  if (hspi != &hspi1) return;
  if (g_activePot < 4) {
    PotSelect(g_activePot, GPIO_PIN_SET);
  }
  g_activePot = 0xFF;
  g_spiBusy = false;
}

void HAL_I2C_MspInit(I2C_HandleTypeDef *i2cHandle) {
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  if (i2cHandle->Instance == I2C1) {
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_I2C1_CLK_ENABLE();

    GPIO_InitStruct.Pin = GPIO_PIN_6 | GPIO_PIN_7;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    HAL_NVIC_SetPriority(I2C1_EV_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(I2C1_EV_IRQn);
    HAL_NVIC_SetPriority(I2C1_ER_IRQn, 1, 1);
    HAL_NVIC_EnableIRQ(I2C1_ER_IRQn);
  }
}

void HAL_SPI_MspInit(SPI_HandleTypeDef *spiHandle) {
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  if (spiHandle->Instance == SPI1) {
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_SPI1_CLK_ENABLE();

    GPIO_InitStruct.Pin = GPIO_PIN_5 | GPIO_PIN_7;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
    /* 2LINES mode: MISO must be AF even if MCP41010 has no MISO (tie/pull in HW optional). */
    GPIO_InitStruct.Pin = GPIO_PIN_6;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    __HAL_RCC_DMA2_CLK_ENABLE();
    hdma_spi1_tx.Instance = DMA2_Stream3;
    hdma_spi1_tx.Init.Channel = DMA_CHANNEL_3;
    hdma_spi1_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
    hdma_spi1_tx.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_spi1_tx.Init.MemInc = DMA_MINC_ENABLE;
    hdma_spi1_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma_spi1_tx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    hdma_spi1_tx.Init.Mode = DMA_NORMAL;
    hdma_spi1_tx.Init.Priority = DMA_PRIORITY_HIGH;
    hdma_spi1_tx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
    if (HAL_DMA_Init(&hdma_spi1_tx) != HAL_OK) {
      Error_Handler();
    }
    __HAL_LINKDMA(spiHandle, hdmatx, hdma_spi1_tx);

    HAL_NVIC_SetPriority(DMA2_Stream3_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(DMA2_Stream3_IRQn);
  }
}

